src/init.org
#+TITLE: Emacs Configuration File
#+AUTHOR: esac-io
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes

* EOS

  Using emacs (lisp interpreter) as the only IO bridge
  between human and machine.

** Bootstrap
*** Header

    Define the package header to avoid warnings.

    #+BEGIN_SRC emacs-lisp

    ;;; Package --- eos
    ;;; Commentary:
    ;;; Code:

    #+END_SRC

*** Lexical

    Lexical binding opens up many more opportunities
    for optimization, so programs using it are likely to run
    faster in future Emacs versions.

    Lexical binding is also more compatible with concurrency,
    which was added to Emacs in version 26.1.

    #+BEGIN_SRC emacs-lisp

    ;;; -*- lexical-binding: t -*-

    #+END_SRC

*** Version

    Verify emacs version.

*** Literate

    Literate programming is a programming paradigm
    introduced by Donald Knuth in which a computer program is
    given an explanation of its logic in a natural language,
    such as English, interspersed with snippets of macros and
    traditional source code, from which compilable source code
    can be generated.

    Literate programming it's only possible thanks to org-mode.

    #+BEGIN_SRC emacs-lisp

    (when (require 'org nil t)
      (progn
        ;; customize
        (customize-set-variable 'org-src-fontify-natively t)
        (customize-set-variable 'org-src-tab-acts-natively t)
        (customize-set-variable 'org-edit-src-content-indentation 0)
        (customize-set-variable 'org-export-with-smart-quotes t)
        (customize-set-variable 'org-confirm-babel-evaluate nil)
        (customize-set-variable 'org-src-window-setup 'current-window)

        ;; load languages
        (org-babel-do-load-languages 'org-babel-load-languages
                                     '((emacs-lisp . t)))))

    #+END_SRC

*** Build

    Tangle emacs-lisp source code blocks and byte-compile it.

    #+BEGIN_SRC emacs-lisp

    (defun eos/build ()
      "Tangle Emacs Lisp source code blocks in eos.el file, and compile it."
      (interactive)
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file (concat user-emacs-directory "init.el"))))

    #+END_SRC

*** Garbage Colletor

    This works surprisingly well. While the minibuffer is open,
    garbage collection will never occur, but once we
    make a selection, or cancel, garbage collection will kick
    off immediately and then revert back to the default,
    sensible behavior.

    #+BEGIN_SRC emacs-lisp

    (defun eos/minibuffer/setup-hook ()
      "Set 'gc-cons-threshold most."
      (setq gc-cons-threshold most-positive-fixnum))

    (defun eos/minibuffer/exit-hook ()
      "Set 'gc-cons-threshold to 800000 (magic number)."
      (setq gc-cons-threshold 800000))

    ;; threshold inital value
    (let ((gc-cons-threshold most-positive-fixnum)))

    ;; set threshold to 800000)
    (add-hook 'minibuffer-setup-hook 'eos/minibuffer/setup-hook)

    ;; reset threshold to inital value
    (add-hook 'minibuffer-exit-hook 'eos/minibuffer/exit-hook)

    #+END_SRC

*** Private

    Some settings are private, this file must contain these
    variables/features.

    #+BEGIN_SRC emacs-lisp

    ;; Load private.el after emacs initialize.
    (add-hook 'after-init-hook
              (lambda ()
                (let ((private-file (concat user-emacs-directory "private.el")))
                  (when (file-exists-p private-file)
                    (load-file private-file)))))

    #+END_SRC

*** Server

    Allow this Emacs process to be a server for client processes.
    This starts a server communications subprocess through which
    client "editors" can send your editing commands to this
    Emacs job. To use the server, set up the program ‘emacsclient’
    in the Emacs distribution as your standard "editor".

    #+BEGIN_SRC emacs-lisp

    ;; start emacs server
    (server-start)

    #+END_SRC

** Vanilla
*** Aliases

    #+BEGIN_SRC emacs-lisp

    ;; y or n
    (defalias 'yes-or-no-p 'y-or-n-p)

    #+END_SRC

*** Keymaps
**** Define

     Basically we creates new maps (prefix) to put major/minor
     modes related keybinds.

     #+BEGIN_SRC emacs-lisp

     (defvar eos-tags-map
       (make-sparse-keymap)
       "Keymap for tags (navigation) keybinds.")

     (defvar eos-pm-map
       (make-sparse-keymap)
       "Keymap for project manager keybinds.")

     (defvar eos-sc-map
       (make-sparse-keymap)
       "Keymap for syntax check keybinds.")

     (defvar eos-complete-map
       (make-sparse-keymap)
       "Keymap for (complete) keybinds.")

     (defvar eos-window-map
       (make-sparse-keymap)
       "Keymap for window related keybinds.")

     (defvar eos-docs-map
       (make-sparse-keymap)
       "Keymap for documentation keybinds.")

     (defvar eos-rtags-map
       (make-sparse-keymap)
       "Keymap for rtag minor mode keybinds.")

     #+END_SRC

**** Define Command

     Define maps as prefix commands.

     #+BEGIN_SRC emacs-lisp

     (dolist (prefix-map '(eos-tags-map
                           eos-pm-map
                           eos-sc-map
                           eos-docs-map
                           eos-window-map
                           eos-complete-map
                           eos-rtags-map))
       (define-prefix-command prefix-map))

     #+END_SRC

*** Utils
**** Funcall

     Funcall wrapper, if function is bounded, call it.

     #+BEGIN_SRC emacs-lisp

     (defun eos/funcall (func &optional args)
       "Call function (FUNC ARGS), if that function symbol it's not void."
       (when (fboundp func)
         (funcall func args)))

     #+END_SRC

**** Load

     Load file function, load the file if exists.

     #+BEGIN_SRC emacs-lisp

     (defun eos/load-file (file)
       "Load FILE if exists."
       (if (file-exists-p file)
           (load (expand-file-name file) t nil nil)))

     #+END_SRC

**** Debug

     Enable/Disable debug-on-error.

     #+BEGIN_SRC emacs-lisp

     (defun eos/toggle-debug-on-error ()
       "Toggle `debug-on-error`."
       (interactive)
       (customize-set-variable 'debug-on-error (not debug-on-error))
       (message "Debug-on-error: %s"
                (if debug-on-error "enabled" "disabled")))

     #+END_SRC

**** Files

     Create a directory in the virtual file system, only if
     he does not exists.

     #+BEGIN_SRC emacs-lisp

     (defun eos/mkdir (dir)
       "Create DIR in the file system."
       ;; (interactive "P")
       (when (and (not (file-exists-p dir))
                  (make-directory dir :parents))))

     #+END_SRC

**** Compile

     Just a compile wrapper function.

     #+BEGIN_SRC emacs-lisp

     (defun eos/compile (dir command)
       "Compile COMMAND at specific DIR.
     Just a `compile` function wrapper."
       (interactive)
       (if (file-exists-p dir)
           (let ((default-directory dir))
             (compile command))))

     #+END_SRC

**** Move

     #+BEGIN_SRC emacs-lisp

     (defun eos/move/beginning-of-line (arg)
       "Move point back to indentation(ARG) start, or line(ARG) start."
       (interactive "^p")
       (setq arg (or arg 1))

       ;; Move lines first
       (when (/= arg 1)
         (let ((line-move-visual nil))
           (forward-line (1- arg))))

       (let ((orig-point (point)))
         (back-to-indentation)
         (when (= orig-point (point))
           (move-beginning-of-line 1))))

     #+END_SRC

***** Bind

      #+BEGIN_SRC emacs-lisp

      ;; line movement
      (global-set-key (kbd "C-a") 'eos/move/beginning-of-line)
      (global-set-key (kbd "C-e") 'move-end-of-line)

      ;; word movement
      (global-set-key (kbd "C-<left>") 'backward-word)
      (global-set-key (kbd "C-<right>") 'forward-whitespace)

      ;; scroll movement
      (global-set-key (kbd "C-M-v") 'scroll-other-window)
      (global-set-key (kbd "C-M-y") 'scroll-other-window-down)

      #+END_SRC

**** Edit
