src/init.el
;;; Package --- eos
;;; Commentary:
;;; Code:

;;; -*- lexical-binding: t -*-

(when (require 'org nil t)
  (progn
    ;; customize
    (customize-set-variable 'org-src-fontify-natively t)
    (customize-set-variable 'org-src-tab-acts-natively t)
    (customize-set-variable 'org-edit-src-content-indentation 0)
    (customize-set-variable 'org-export-with-smart-quotes t)
    (customize-set-variable 'org-confirm-babel-evaluate nil)
    (customize-set-variable 'org-src-window-setup 'current-window)

    ;; load languages
    (org-babel-do-load-languages 'org-babel-load-languages
                                 '((emacs-lisp . t)))))

(defun eos/build ()
  "Tangle Emacs Lisp source code blocks in eos.el file, and compile it."
  (interactive)
  (let ((prog-mode-hook nil))
    (org-babel-tangle)
    (byte-compile-file (concat user-emacs-directory "init.el"))))

(defun eos/minibuffer/setup-hook ()
  "Set 'gc-cons-threshold most."
  (setq gc-cons-threshold most-positive-fixnum))

(defun eos/minibuffer/exit-hook ()
  "Set 'gc-cons-threshold to 800000 (magic number)."
  (setq gc-cons-threshold 800000))

;; threshold inital value
(let ((gc-cons-threshold most-positive-fixnum)))

;; set threshold to 800000)
(add-hook 'minibuffer-setup-hook 'eos/minibuffer/setup-hook)

;; reset threshold to inital value
(add-hook 'minibuffer-exit-hook 'eos/minibuffer/exit-hook)

;; Load private.el after emacs initialize.
(add-hook 'after-init-hook
          (lambda ()
            (let ((private-file (concat user-emacs-directory "private.el")))
              (when (file-exists-p private-file)
                (load-file private-file)))))

;; start emacs server
(server-start)

;; y or n
(defalias 'yes-or-no-p 'y-or-n-p)

(defvar eos-tags-map
  (make-sparse-keymap)
  "Keymap for tags (navigation) keybinds.")

(defvar eos-pm-map
  (make-sparse-keymap)
  "Keymap for project manager keybinds.")

(defvar eos-sc-map
  (make-sparse-keymap)
  "Keymap for syntax check keybinds.")

(defvar eos-complete-map
  (make-sparse-keymap)
  "Keymap for (complete) keybinds.")

(defvar eos-window-map
  (make-sparse-keymap)
  "Keymap for window related keybinds.")

(defvar eos-docs-map
  (make-sparse-keymap)
  "Keymap for documentation keybinds.")

(defvar eos-rtags-map
  (make-sparse-keymap)
  "Keymap for rtag minor mode keybinds.")

(dolist (prefix-map '(eos-tags-map
                      eos-pm-map
                      eos-sc-map
                      eos-docs-map
                      eos-window-map
                      eos-complete-map
                      eos-rtags-map))
  (define-prefix-command prefix-map))

(defun eos/funcall (func &optional args)
  "Call function (FUNC ARGS), if that function symbol it's not void."
  (when (fboundp func)
    (funcall func args)))

(defun eos/load-file (file)
  "Load FILE if exists."
  (if (file-exists-p file)
      (load (expand-file-name file) t nil nil)))

(defun eos/toggle-debug-on-error ()
  "Toggle `debug-on-error`."
  (interactive)
  (customize-set-variable 'debug-on-error (not debug-on-error))
  (message "Debug-on-error: %s"
           (if debug-on-error "enabled" "disabled")))

(defun eos/mkdir (dir)
  "Create DIR in the file system."
  ;; (interactive "P")
  (when (and (not (file-exists-p dir))
             (make-directory dir :parents))))

(defun eos/compile (dir command)
  "Compile COMMAND at specific DIR.
Just a `compile` function wrapper."
  (interactive)
  (if (file-exists-p dir)
      (let ((default-directory dir))
        (compile command))))

(defun eos/move/beginning-of-line (arg)
  "Move point back to indentation(ARG) start, or line(ARG) start."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; line movement
(global-set-key (kbd "C-a") 'eos/move/beginning-of-line)
(global-set-key (kbd "C-e") 'move-end-of-line)

;; word movement
(global-set-key (kbd "C-<left>") 'backward-word)
(global-set-key (kbd "C-<right>") 'forward-whitespace)

;; scroll movement
(global-set-key (kbd "C-M-v") 'scroll-other-window)
(global-set-key (kbd "C-M-y") 'scroll-other-window-down)
