src/init.el

(defun eos/edit/move-lines (n)
  "Move N lines, up if N is positive, else down."
  (let* (text-start
         text-end
         (region-start (point))
         (region-end region-start)
         swap-point-mark
         delete-latest-newline)

    ;; STEP 1: identifying the text to cut.
    (when (region-active-p)
      (if (> (point) (mark))
          (setq region-start (mark))
        (exchange-point-and-mark)
        (setq swap-point-mark t
              region-end (point))))

    ;; text-end and region-end
    (end-of-line)

    (if (< (point) (point-max))
        (forward-char 1)
      (setq delete-latest-newline t)
      (insert-char ?\n))
    (setq text-end (point)
          region-end (- region-end text-end))

    ;; text-start and region-start
    (goto-char region-start)
    (beginning-of-line)
    (setq text-start (point)
          region-start (- region-start text-end))

    ;; STEP 2: cut and paste.
    (let ((text (delete-and-extract-region text-start text-end)))
      (forward-line n)
      ;; If the current-column != 0, I have moved the region at the bottom of a
      ;; buffer doesn't have the trailing newline.
      (when (not (= (current-column) 0))
        (insert-char ?\n)
        (setq delete-latest-newline t))
      (insert text))

    ;; STEP 3: Restoring.
    (forward-char region-end)

    (when delete-latest-newline
      (save-excursion
        (goto-char (point-max))
        (delete-char -1)))

    (when (region-active-p)
      (setq deactivate-mark nil)
      (set-mark (+ (point) (- region-start region-end)))
      (if swap-point-mark
          (exchange-point-and-mark)))))

(defun eos/edit/move-lines-up (n)
  "Move N lines up."
  (interactive "p")
  (if (eq n nil)
      (setq n 1))
  (eos/edit/move-lines (- n)))

(defun eos/edit/move-lines-down (n)
  "Move N lines down."
  (interactive "p")
  (if (eq n nil)
      (setq n 1))
  (eos/edit/move-lines n))

(defun eos/edit/move-words-left (n)
  "Move word N times to the left."
  (interactive "p")
  (if (eq n nil)
      (setq n 1))
  (transpose-words (- n)))

(defun eos/edit/indent-buffer ()
  "Indent the currently visited buffer."
  (interactive)
  (indent-region (point-min) (point-max)))

(defun eos/edit/indent-region-or-buffer ()
  "Indent a region if selected, otherwise the whole buffer."
  (interactive)
  (save-excursion
    (if (region-active-p)
        (progn
          (indent-region (region-beginning) (region-end))
          (message "Indented selected region."))
      (progn
        (eos/edit/indent-buffer)
        (message "Indented buffer.")))))

(defun eos/edit/duplicate-current-line-or-region (arg)
  "Duplicates the current line or region ARG times.
If there's no region, the current line will be duplicated.
However, if there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (let (beg end (origin (point)))
    (if (and mark-active (> (point) (mark)))
        (exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
        (exchange-point-and-mark))
    (setq end (line-end-position))
    (let ((region (buffer-substring-no-properties beg end))
          (i arg))
      (while (> i 0)
        (goto-char end)
        (newline)
        (insert region)
        (setq end (point))
        (setq i (1- i)))
      (goto-char (+ origin (* (length region) arg) arg)))))

;; edit
(global-set-key (kbd "M-i") 'eos/edit/indent-region-or-buffer)
(global-set-key (kbd "M-j") 'eos/edit/duplicate-current-line-or-region)

(global-set-key (kbd "M-<up>") 'eos/edit/move-lines-up)
(global-set-key (kbd "M-<down>") 'eos/edit/move-lines-down)
;; edit (terminal quick fix)
(global-set-key (kbd "ESC <up>") 'eos/edit/move-lines-up)
(global-set-key (kbd "ESC <down>") 'eos/edit/move-lines-down)

(defun eos/kill-buffer (buffer-name)
  "Kill BUFFER-NAME if exists."
  (if (get-buffer (buffer-name))
      (kill-buffer buffer-name) nil))

(defun eos/kill/current-buffer ()
  "Kill the current buffer without prompting."
  (interactive)
  (kill-buffer (current-buffer)))

(defun eos/run/async-proc (name)
  "Run a asynchronous process defined by NAME."
  (interactive)
  (start-process name nil name))

;;; Get symbol at point, maybe
(defun eos/get-selected-text-or-symbol-at-point ()
  "Get the text in region or symbol at point.

If region is active, return the text in that region.  Else if the
point is on a symbol, return that symbol name.  Else return nil."
  (cond ((use-region-p)
         (buffer-substring-no-properties (region-beginning) (region-end)))
        ((symbol-at-point)
         (substring-no-properties (thing-at-point 'symbol)))
        (t
         nil)))

;; always select the help window
(customize-set-variable 'help-window-select t)

(defun eos/set-frame-font (font)
  "Set the default font to FONT."
  (cond ((find-font (font-spec :name font))
         (set-frame-font font nil t))))

;; hermit light
(defvar eos-font "Hermit Light:pixelsize=18"
  "Default eos font.")

;; set frame font
(eos/set-frame-font eos-font)

;; set font by face attribute (reference)
;; (set-face-attribute 'default nil :height)

;; disable fringe
(add-hook 'after-init-hook
          (lambda () (fringe-mode '(0 . 0))))

;; autosave/backups options
(customize-set-variable 'version-control t)
(customize-set-variable 'kept-new-versions 6)
(customize-set-variable 'backup-by-copying t)
(customize-set-variable 'kept-old-versions 2)
(customize-set-variable 'delete-old-versions t)
(customize-set-variable 'make-backup-files nil)
(customize-set-variable 'auto-save-default nil)

;; set backup directory list
(customize-set-variable
 'backup-directory-alist
 '(("" . (concat user-emacs-directory "backup"))))

;; set autosave locations and format
(customize-set-variable
 'auto-save-list-file-prefix
 (concat user-emacs-directory "backup/.saves-"))

;; create cache directory
(mkdir (concat user-emacs-directory "cache") t)

;; recentf location
(customize-set-variable
 'recentf-save-file
 (concat user-emacs-directory "cache/recentf"))

;; bookmark file location
(customize-set-variable
 'bookmark-default-file
 (concat user-emacs-directory "cache/bookmarks"))

;; with some window managers you may have to set this to non-nil
;; in order to set the size of a frame in pixels, to maximize
;; frames or to make them fullscreen.
(customize-set-variable 'frame-resize-pixelwise t)

;; normalize before maximize
(customize-set-variable 'x-frame-normalize-before-maximize t)

;; set frame title format
(customize-set-variable 'frame-title-format
                        '((:eval (if (buffer-file-name)
                                     (abbreviate-file-name (buffer-file-name))
                                   "%b"))))

;; fullscreen
(add-to-list 'initial-frame-alist '(fullscreen . fullheight))

;; internal border
(add-to-list 'default-frame-alist '(internal-border-width . 2))

;; scroll options
