src/init.el
(customize-set-variable 'scroll-margin 0)
(customize-set-variable 'scroll-conservatively 100)
(customize-set-variable 'scroll-preserve-screen-position 1)

;; never show dialogs box
(customize-set-variable 'use-dialog-box nil)

;; window move default keybinds (shift-up/down etc..)
(add-hook 'after-init-hook 'windmove-default-keybindings)

;; set window margins
(customize-set-variable 'left-margin-width 1)
(customize-set-variable 'right-margin-width 1)

;; set window divider
(add-hook 'after-init-hook 'window-divider-mode)

;; global bind
(global-set-key (kbd "<s-left>") 'shrink-window-horizontally)
(global-set-key (kbd "<s-right>") 'enlarge-window-horizontally)
(global-set-key (kbd "<s-down>") 'shrink-window)
(global-set-key (kbd "<s-up>") 'enlarge-window)

;; eos-window-map bind
;; (define-key eos-window-map (kbd "j") 'windmove-up)
;; (define-key eos-window-map (kbd "k") 'windmove-down)
;; (define-key eos-window-map (kbd "h") 'windmove-left)
;; (define-key eos-window-map (kbd "l") 'windmove-right)

(define-key eos-window-map (kbd "1") 'maximize-window)
(define-key eos-window-map (kbd "q") 'minimize-window)
(define-key eos-window-map (kbd "w") 'balance-windows)

;; ctl-x-map bind (C-x w)
(define-key ctl-x-map (kbd "w") 'eos-window-map)

;; linum format
(customize-set-variable 'linum-format " %2d ")

;; truncate lines
(customize-set-variable 'truncate-lines nil)

;; Most *NIX tools work best when files are terminated
;; with a newline.
(customize-set-variable 'require-final-newline t)

;; sentences should be separated by a single space,
;; so treat two sentences as two when filling.
(customize-set-variable 'sentence-end-double-space nil)

;; default indent
(customize-set-variable 'tab-width 4)
(customize-set-variable 'indent-tabs-mode nil)

;; kill process not confirmation required
(customize-set-variable
 'kill-buffer-query-functions
 (remq 'process-kill-buffer-query-function kill-buffer-query-functions))

;; delete selection-mode
(eos/funcall 'delete-selection-mode 1)

;; clean whitespace and newlines before buffer save
(add-hook 'before-save-hook 'whitespace-cleanup)

;; prefer newer
(customize-set-variable 'load-prefer-newer t)

(customize-set-variable 'enable-recursive-minibuffers t)

;; bind kmacro-keymap to C-x m
(define-key ctl-x-map (kbd "m") 'kmacro-keymap)

(global-set-key (kbd "M-c") 'comment-or-uncomment-region)

;; conding-system (utf8)
(customize-set-variable 'locale-coding-system 'utf-8)
(customize-set-variable 'buffer-file-coding-system 'utf-8)

(prefer-coding-system 'utf-8)
(set-language-environment "UTF-8")
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)

(customize-set-variable 'visible-cursor nil)

(require 'timeclock nil t)

;; always refresh the modeline (reference)
;; (add-hook 'buffer-list-update-hook 'eos/mode-line)

(customize-set-variable 'eval-expression-print-level nil)

;; set custom-file
(customize-set-variable 'custom-file (concat user-emacs-directory "custom.el"))

;; load custom file
(eos/load-file custom-file)

;; clean startup message/area
(customize-set-variable 'inhibit-startup-screen t)
(customize-set-variable 'inhibit-startup-message nil)
(customize-set-variable 'inhibit-startup-echo-area-message nil)
(customize-set-variable 'inhibit-buffer-choice nil)

(customize-set-variable 'electric-pair-pairs
                        '((?\{ . ?\})
                          (?\( . ?\))
                          (?\[ . ?\])
                          (?\" . ?\")))

;; disabled modes list
(dolist (mode
         '(tool-bar-mode
           tooltip-mode
           menu-bar-mode
           scroll-bar-mode
           blink-cursor-mode))
  (eos/funcall mode 0))

;; enabled modes list
(dolist (mode
         '(savehist-mode
           show-paren-mode
           column-number-mode
           size-indication-mode
           electric-pair-mode
           global-subword-mode
           global-display-line-numbers-mode
           global-hl-line-mode))
  (eos/funcall mode 1))

;; exit/quit
(define-key ctl-x-map (kbd "C-g") 'keyboard-quit)

;; text scale adjust
(define-key ctl-x-map (kbd "=") 'text-scale-adjust)

;; whitespace-mode
(global-set-key (kbd "M-.") 'whitespace-mode)

;; kill buffer and window
(define-key ctl-x-map (kbd "C-k") 'kill-buffer-and-window)

;; eval when compile (avoid byte-compile warnings)
(eval-when-compile
  (when (require 'cask "~/.cask/cask.el" t)
    (progn
      (cask-initialize))))

;; load cask (maybe)
(require 'cask "~/.cask/cask.el" t)

;; initialize cask
(eos/funcall 'cask-initialize)
