src/init.el

(when (require 'exwm nil t)
  (progn
    (require 'exwm-config nil t)

    ;; set exwm workspaces
    (customize-set-variable 'exwm-workspace-number 0)

    ;; show workspaces in all buffers
    (customize-set-variable 'exwm-workspace-show-all-buffers t)

    ;; Non-nil to allow switching to buffers on other workspaces
    (customize-set-variable 'exwm-layout-show-all-buffers t)

    ;; exwn global keybindings
    (customize-set-variable 'exwm-input-global-keys
                            `(([?\s-r] . exwm-reset)
                              ([?\s-w] . exwm-workspace-switch)
                              ([?\s-q] . exwm-input-toggle-keyboard)

                              ;; ([?\s-k] . exwm-workspace-delete)
                              ;; ([?\s-a] . exwm-workspace-swap)

                              ;; create and switch to workspaces
                              ,@(mapcar (lambda (i)
                                          `(,(kbd (format "s-%d" i)) .
                                            (lambda ()
                                              (interactive)
                                              (exwm-workspace-switch-create ,i))))
                                        (number-sequence 0))))

    ;; The following example demonstrates how to use simulation keys to mimic
    ;; the behavior of Emacs.  The value of `exwm-input-simulation-keys` is a
    ;; list of cons cells (SRC . DEST), where SRC is the key sequence you press
    ;; and DEST is what EXWM actually sends to application.  Note that both SRC
    ;; and DEST should be key sequences (vector or string).
    (customize-set-variable 'exwm-input-simulation-keys
                            '(
                              ;; movement
                              ([?\C-b] . [left])
                              ([?\M-b] . [C-left])
                              ([?\C-f] . [right])
                              ([?\M-f] . [C-right])
                              ([?\C-p] . [up])
                              ([?\C-n] . [down])
                              ([?\C-a] . [home])
                              ([?\C-e] . [end])
                              ([?\M-v] . [prior])
                              ([?\C-v] . [next])
                              ([?\C-d] . [delete])
                              ([?\C-k] . [S-end delete])
                              ([?\C-k] . [C-w]) ;; firefox close tab, temporary!

                              ;; cut/paste.
                              ([?\C-w] . [?\C-x])
                              ([?\M-w] . [?\C-c])
                              ([?\C-y] . [?\C-v])

                              ;; Escape (cancel)
                              ([?\C-g] . [escape])

                              ;; search
                              ([?\C-s] . [?\C-f])))))

;; this little bit will make sure that XF86 keys work in exwm buffers as well
(if (boundp 'exwm-input-prefix-keys)
    (progn
      (dolist (key '(XF86AudioLowerVolume
                     XF86AudioRaiseVolume
                     XF86PowerOff
                     XF86AudioMute
                     XF86AudioPlay
                     XF86AudioStop
                     XF86AudioPrev
                     XF86AudioNext
                     XF86ScreenSaver
                     XF68Back
                     XF86Forward
                     Scroll_Lock
                     print))
        (cl-pushnew key exwm-input-prefix-keys))))

;; enable exwm
(eos/funcall 'exwm-enable)

;; All buffers created in EXWM mode are named "*EXWM*". You may want to
;; change it in `exwm-update-class-hook' and `exwm-update-title-hook', which
;; are run when a new X window class name or title is available.  Here's
;; some advice on this topic:
;; + Always use `exwm-workspace-rename-buffer` to avoid naming conflict.
;; + For applications with multiple windows (e.g. GIMP), the class names of
;; all windows are probably the same.  Using window titles for them makes
;; more sense.
(require 'exwm-core nil t)
(require 'exwm-workspace nil t)

;; update the buffer name by X11 window title
(add-hook 'exwm-update-title-hook
          (lambda ()
            (exwm-workspace-rename-buffer
             (concat "[" exwm-class-name "] " exwm-title))))

(when (require 'exwm-randr nil t)
  (progn
    ;; set exwm workspaces
    (customize-set-variable 'exwm-workspace-number 2)

    ;; customize monitors
    (customize-set-variable
     'exwm-randr-workspace-monitor-plist '(0 "HDMI-1"))

    (customize-set-variable
     'exwm-randr-workspace-monitor-plist '(1 "DP-1"))

    (add-hook 'exwm-randr-screen-change-hook
              (lambda ()
                (start-process-shell-command
                 "xrandr" nil "xrandr --output HDMI-1 --left-of DP-1 --auto")))

    ;; enable exwm randr
    ;; (exwm-randr-enable)
    ))

(when (require 'helm nil t)
  (progn
    ;; default input idle delay
    (customize-set-variable 'helm-idle-delay 0.1)
    (customize-set-variable 'helm-input-idle-delay 0.1)

    ;; set autoresize max and mim height
    (customize-set-variable 'helm-autoresize-max-height 50)
    (customize-set-variable 'helm-autoresize-min-height 20)

    ;; enable fuzzing matching
    (customize-set-variable 'helm-M-x-fuzzy-match t)
    (customize-set-variable 'helm-imenu-fuzzy-match t)
    (customize-set-variable 'helm-locate-fuzzy-match t)
    (customize-set-variable 'helm-recentf-fuzzy-match t)
    (customize-set-variable 'helm-apropos-fuzzy-match t)
    (customize-set-variable 'helm-lisp-fuzzy-completion t)
    (customize-set-variable 'helm-buffers-fuzzy-matching t)

    ;; save console history
    (customize-set-variable 'helm-M-x-always-save-history t)

    ;; clean details flag
    (customize-set-variable 'helm-buffer-details-flag nil)

    ;; split window in side
    (customize-set-variable 'helm-split-window-in-side-p t)

    ;; move in cycles
    (customize-set-variable 'helm-move-to-line-cycle-in-source t)

    ;; set scroll reaching
    (customize-set-variable 'helm-scroll-amount 8)

    ;; show input header
    (customize-set-variable 'helm-echo-input-in-header-line t)

    ;; search for library in 'require' and 'declare-function' sexp.
    (customize-set-variable 'helm-ff-search-library-in-sexp t)

    ;; use 'recentf-list' instead of 'file-name-history' in 'helm-find-files'.
    (customize-set-variable 'helm-ff-file-name-history-use-recentf t)

    ;; handle completion in region
    (customize-set-variable 'helm-mode-handle-completion-in-region t)

    ;; don't display header line
    (customize-set-variable 'helm-display-header-line nil)

    ;; bind (C-x)
    (define-key ctl-x-map (kbd "C-b") 'helm-mini)
    (define-key ctl-x-map (kbd "C-f") 'helm-find-files)

    ;; bind global map
    (global-set-key (kbd "M-x") 'helm-M-x)
    (global-set-key (kbd "M-y") 'helm-show-kill-ring)

    ;; init helm mode
    (add-hook 'after-init-hook 'helm-mode)))

;; bind
(when (boundp 'helm-map)
  (progn
    (define-key helm-map (kbd "TAB") 'helm-execute-persistent-action)
    (define-key helm-map (kbd "C-j") 'helm-maybe-exit-minibuffer)
    (define-key helm-map (kbd "C-z") 'helm-select-action)))
