src/init.el

(when (require 'helm-descbinds nil t)
  (progn
    ;; helm-descbinds, window splitting style (2: vertical)
    (customize-set-variable 'helm-descbinds-window-style 2)))

;; bind
(define-key help-map (kbd "b") 'helm-descbinds)

;; unbind (clean, quality of life)
(define-key help-map (kbd "<help>") nil)
(define-key help-map (kbd "<f1>") nil)
(define-key help-map (kbd "C-n") nil)
(define-key help-map (kbd "C-h") nil)
(define-key help-map (kbd "C-;") nil)
(define-key help-map (kbd "K") nil)
(define-key help-map (kbd "RET") nil)

(when (require 'iedit nil t)
  (progn
    ;; If no-nil, the key is inserted into global-map,
    ;; isearch-mode-map, esc-map and help-map.
    (customize-set-variable 'iedit-toggle-key-default nil)))

;; bind
(when (boundp 'iedit-mode-keymap)
  (define-key iedit-mode-keymap (kbd "TAB") 'eos/complete-or-indent))

(when (require 'undo-tree)
  (progn
    ;; define alias for redo
    (defalias 'redo 'undo-tree-redo)

    ;; binds
    (define-key ctl-x-map (kbd "u") 'undo-tree-visualize)

    ;; init after emacs initialize
    (add-hook 'after-init-hook 'global-undo-tree-mode)))

(when (require 'editorconfig nil t)
  (progn
    (add-hook 'after-init-hook 'editorconfig-mode)))

(when (require 'helm-swoop nil t)
  (progn
    ;; customize
    (customize-set-variable 'helm-swoop-speed-or-color nil)
    (customize-set-variable 'helm-swoop-split-with-multiple-windows t)
    (customize-set-variable 'helm-swoop-use-fuzzy-match t)
    (customize-set-variable 'helm-swoop-move-to-line-cycle t)
    (customize-set-variable 'helm-swoop-use-line-number-face t)

    ;; bind global
    (global-set-key (kbd "C-s") 'helm-swoop)))

;; bind helm-swoop-map
(when (boundp 'helm-swoop-map)
  (progn
    (define-key helm-swoop-map (kbd "C-s")
      'helm-multi-swoop-all-from-helm-swoop)

    (define-key helm-swoop-map (kbd "C-c s c")
      'helm-multi-swoop-current-mode-from-helm-swoop)))

(when (require 'helm-locate nil t)
  (progn
    ;; customize locate command
    (customize-set-variable 'helm-locate-command "locate %s %s")))

;; load helm-imenu
(when (require 'helm-imenu nil t)
  (progn
    ;; bind
    (define-key ctl-x-map (kbd "TAB") 'helm-imenu-in-all-buffers)))

;; bind global
;; (global-set-key (kbd "C-M-i") 'helm-imenu-in-all-buffers)))

;; bind
(when (boundp 'helm-imenu-map)
  (progn
    (define-key helm-imenu-map (kbd "C-M-i") 'helm-next-source)))

(require 'helm-ag nil t)

(when (require 'shr nil t)
  (progn
    (customize-set-variable 'shr-width 80)
    (customize-set-variable 'shr-use-fonts nil)
    (customize-set-variable 'shr-use-colors nil)
    (customize-set-variable 'shr-inhibit-images t)
    (customize-set-variable 'shr-blocked-images t)
    (customize-set-variable 'shr-color-visible-distance-min 10)
    (customize-set-variable 'shr-color-visible-luminance-min 80)))

(when (require 'eww nil t)
  (progn
    ;; define google search url
    (defvar eos/eww-google-search-url "https://www.google.com/search?q="
      "URL for Google searches.")

    ;; customize search prefix
    (customize-set-variable 'eww-search-prefix eos/eww-google-search-url)
    ;; (customize-set-variable eww-search-prefix "https://duckduckgo.com/html/?q=")

    ;; customize download directory
    (customize-set-variable 'eww-download-directory "~/down")

    ;; customize checkbox symbols
    (customize-set-variable 'eww-form-checkbox-symbol "[ ]")
    (customize-set-variable 'eww-form-checkbox-selected-symbol "[X]")
    ;; (customize-set-variable eww-form-checkbox-symbol "☐") ; Unicode hex 2610
    ;; (customize-set-variable eww-form-checkbox-selected-symbol "☑") ; Unicode hex 2611

    ;; Re-write of the `eww-search-words' definition.
    (defun eos/eww-search-words ()
      "Search the web for the text between BEG and END.
If region is active (and not whitespace), search the web for
the text in that region.
Else if the region is not active, and the point is on a symbol,
search the web for that symbol.
Else prompt the user for a search string.
See the `eww-search-prefix' variable for the search engine used."
      (interactive)
      (let ((search-string (eos/get-selected-text-or-symbol-at-point)))
        (when (and (stringp search-string)
                   (string-match-p "\\`[[:blank:]]*\\'" search-string))
          (customize-set-variable search-string nil))
        (if (stringp search-string)
            (eww search-string)
          (call-interactively #'eww))))
    ))

(when (require 'browse-url nil t)
  (progn
    ;; customize browse-url options
    (customize-set-variable 'browse-url-generic-program "eww")
    (customize-set-variable 'browse-url-function 'eww-browse-url)))

(require 'dired-async nil t)

;; enable find-alternate-file
(put 'dired-find-alternate-file 'disabled nil)

;; enable dired-aysnc-mode
(eos/funcall 'dired-async-mode 1)

(when (require 'dired-sidebar nil t)
  (progn
    ;; assign C-f2 to sidebar file browser
    (global-set-key (kbd "C-<f2>") 'dired-sidebar-toggle-sidebar)
    ))

(when (require 'moody nil t)
  (progn
    ;; remove underline
    (customize-set-variable 'x-underline-at-descent-line t)

    ;; change line height
    (customize-set-variable 'moody-mode-line-height 32)

    ;; mode-line format
    (customize-set-variable 'mode-line-format
                            '(" %*%&  %l:%c | %I "
                              moody-mode-line-buffer-identification
                              " %m "
                              (vc-mode moody-vc-mode)))))
