src/init.el

(when (require 'which-key nil t)
  (progn
    ;; customize
    ;; (customize-set-variable 'which-key-paging-key nil)
    (customize-set-variable 'which-key-idle-delay 0.2)
    (customize-set-variable 'which-key-separator " - ")
    (customize-set-variable 'which-key-use-C-h-commands t)
    (customize-set-variable 'which-key-add-column-padding 2)
    (customize-set-variable 'which-key-side-window-location 'bottom)
    (customize-set-variable 'which-key-sort-order
                            'which-key-key-order-alpha)

    ;; bind
    (define-key ctl-x-map (kbd "x") 'which-key-show-major-mode)

    ;; init which-key-mode after emacs initialize
    (add-hook 'after-init-hook 'which-key-mode)))

(when (boundp 'which-key-replacement-alist)
  (progn
    ;; customize key replacements
    (add-to-list 'which-key-replacement-alist
                 '(("\\(.+\\)" .
                    "\\(\\(helm-\\)\\|.?\\(projectile\\|rtags\\|gtags\\|flycheck\\|company\\|dash\\|yas\\)[\-]\\)")
                   . (nil . "")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "helm-dash") . (nil . "search")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "helm-dash-at-point") . (nil . "search-at-point")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "helm-flycheck") . (nil . "list-erros")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "flycheck-list-errors") . (nil . "list-erros-other-window")))

    ;; (add-to-list 'which-key-replacement-alist
    ;;              '(("<left>" . nil) . ("left" . nil)))

    ;; (add-to-list 'which-key-replacement-alist
    ;;              '(("<right>" . nil) . ("right" . nil)))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-rtags-map") . (nil . "rtags")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-tags-map") . (nil . "gtags")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-pm-map") . (nil . "projectile")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-window-map") . (nil . "window")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-docs-map") . (nil . "dash")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-sc-map") . (nil . "flycheck")))

    (add-to-list 'which-key-replacement-alist
                 '((nil . "eos-complete-map") . (nil . "complete")))

    ))

(when (fboundp 'which-key-add-key-based-replacements)
  (which-key-add-key-based-replacements
    "C-x @"   "event"
    "C-x RET" "set"
    "C-x r"   "regs"
    "C-x @"   "event"
    "C-x 4"   "other"
    "C-x 5"   "frame"
    "C-x 6"   "2c"
    "C-x <end>" "lock-screen"
    "C-x ESC"   "rept"
    "C-x 8"   "iso"
    "C-x m"   "kmacro"
    "C-h 4"   "other"))

(when (require 'buffer-move nil t)
  (progn
    ;; bind
    (global-set-key (kbd "C-x <C-up>") 'buf-move-up)
    (global-set-key (kbd "C-x <C-down>") 'buf-move-down)
    (global-set-key (kbd "C-x <C-left>") 'buf-move-left)
    (global-set-key (kbd "C-x <C-right>") 'buf-move-right)))

(require 'eshell nil t)

;; bind
(global-set-key (kbd "C-x [") 'eshell)

(customize-set-variable 'explicit-shell-file-name "/bin/sh")

(defun eos/launch/st ()
  "Launch urxvt"
  (interactive)
  (eos/run/async-proc "st"))

(global-set-key (kbd "C-x ]") 'eos/launch/st)

(when (require 'comint nil t)
  (progn
    ;; disable line number mode
    (add-hook 'comint-mode-hook
              (lambda ()
                (display-line-numbers-mode 0)))))

(when (require 'dmenu nil t)
  (progn
    ;; set dmenu-itens cache location
    (customize-set-variable
     'dmenu-save-file
     (concat user-emacs-directory "cache/dmenu-itens"))

    ;; bind
    (global-set-key (kbd "C-x C-x") 'dmenu)))

;; start compton after emacs initialize
(add-hook 'after-init-hook
          (lambda ()
            (eos/run/async-proc "compton")))

(require 'man nil t)

(add-hook 'Man-mode-hook
          (lambda ()
            ;; don't truncate lines
            (setq truncate-lines nil)))

(when (require 'helm-man nil t)
  (progn
    ;; bind
    (global-set-key (kbd "<f1>") 'helm-man-woman)))

(when (require 'dash-docs nil t)
  (progn
    ;; customize (fix async?)
    ;; (customize-set-variable
    ;;  'dash-docs-use-workaround-for-emacs-bug t)

    ;; bind
    (define-key eos-docs-map (kbd "u") 'dash-docs-update-docset)))

(when (require 'helm-dash nil t)
  (progn
    ;; disable helm dash debug
    (customize-set-variable 'helm-dash-enable-debugging nil)

    ;; set browser function
    (customize-set-variable 'helm-dash-browser-func 'eww)

    ;; binds
    (define-key eos-docs-map (kbd "l") 'helm-dash)
    (define-key eos-docs-map (kbd "p") 'helm-dash-at-point)
    (define-key eos-docs-map (kbd "i") 'helm-dash-install-docset)
    (define-key eos-docs-map (kbd "a") 'helm-dash-activate-docset)))

;; activate docset
(defun eos/dash/activate-docset (docset)
  "Activate a DOCSET, if available."
  (when (fboundp 'helm-dash-activate-docset)
    (funcall 'helm-dash-activate-docset docset)))

(when (require 'rfc-mode nil t)
  (progn
    ;; customize rfc location
    (customize-set-variable
     'rfc-mode-directory (expand-file-name "~/.rfc/"))))

;; bind documentation related functions on eos-docs-map
(define-key eos-docs-map (kbd "C-g") 'keyboard-quit)

;; bind eos-docs-map under ctl-x-map
(define-key ctl-x-map (kbd "l") 'eos-docs-map)
