src/init.org
**** Dashboard

     #+BEGIN_SRC emacs-lisp

     (when (require 'dashboard nil t)
       (progn
         ;; items
         (customize-set-variable 'dashboard-items
                                 '((recents . 5)
                                   (projects . 5)
                                   (agenda . 5)
                                   (bookmarks . 5)))

         ;; banners directory
         (customize-set-variable 'dashboard-banners-directory
                                 (concat user-emacs-directory "banner/"))

         ;; banner
         (customize-set-variable 'dashboard-startup-banner 1)

         ;; page separator
         (customize-set-variable 'dashboard-page-separator "

      ")

         ;; footer icon
         (customize-set-variable 'dashboard-footer-icon
                                 #(" " 0 1 (face dashboard-footer)))

         ;; footer
         (customize-set-variable 'dashboard-footer
                                 "Litany Against Fear

        I must not fear.
        Fear is the mind-killer.
        Fear is the little-death that brings total obliteration.
        I will face my fear.
        I will permit it to pass over me and through me.
        And when it has gone past I will turn the inner eye to see its path.
        Where the fear has gone there will be nothing.
        Only I will remain.
        ")

         ;; set initial buffer choice (emacsclient fix)
         (customize-set-variable 'initial-buffer-choice
                                 (lambda ()
                                   (let ((initial-buffer (get-buffer "*dashboard*")))
                                     (unless initial-buffer
                                       (setq initial-buffer (get-buffer "*scratch*")))
                                     initial-buffer)))

         ;; init dashboard after emacs initialize
         (add-hook 'after-init-hook 'dashboard-setup-startup-hook)))

     #+END_SRC

*** Project Manager
**** Projectile

     Projectile is used as the project management and navigation.

     #+BEGIN_SRC emacs-lisp

     (when (require 'projectile nil t)
       (progn
         ;; customize
         ;; enable cache and choose indexing method
         (customize-set-variable 'projectile-enable-caching t)
         (customize-set-variable 'projectile-indexing-method 'hybrid)
         (customize-set-variable 'projectile-completion-system 'helm)

         ;; set bookmarks file localtion (cache)
         (customize-set-variable 'projectile-known-projects-file
                                 (concat user-emacs-directory "cache/projectile-bookmarks.eld"))

         (customize-set-variable 'projectile-cache-file
                                 (concat user-emacs-directory "cache/projectile.cache"))

         ;; bind
         (define-key eos-pm-map (kbd "g") 'projectile-grep)
         (define-key eos-pm-map (kbd "t") 'projectile-find-tag)
         (define-key eos-pm-map (kbd "x") 'projectile-compile-project)
         (define-key eos-pm-map (kbd "!") 'projectile-run-eshell)
         (define-key eos-pm-map (kbd "o") 'projectile-switch-project)
         (define-key eos-pm-map (kbd "r") 'projectile-replace-regexp)
         (define-key eos-pm-map (kbd "R") 'projectile-replace)
         (define-key eos-pm-map (kbd "s") 'projectile-save-project-buffers)
         (define-key eos-pm-map (kbd "d") 'projectile-discover-projects-in-directory)
         (define-key eos-pm-map (kbd "c") 'projectile-cleanup-known-projects)
         (define-key eos-pm-map (kbd "C") 'projectile-invalidate-cache)
         (define-key eos-pm-map (kbd "U") 'projectile-purge-dir-from-cache)
         (define-key eos-pm-map (kbd "u") 'projectile-purge-file-from-cache)
         (define-key eos-pm-map (kbd ".") 'projectile-edit-dir-locals)
         (define-key eos-pm-map (kbd "k") 'projectile-kill-buffers)
         (define-key eos-pm-map (kbd "D") 'projectile-remove-known-project)

         ;; add hook (init projectile)
         (add-hook 'after-init-hook 'projectile-mode)))

     #+END_SRC

**** Helm-projectile

     Helm-projectile is used as projectile frontend/interface.

     #+BEGIN_SRC emacs-lisp

     (when (require 'helm-projectile nil t)
       (progn
         ;; bind
         (define-key eos-pm-map (kbd "p") 'helm-projectile-ag)
         (define-key eos-pm-map (kbd "n") 'helm-projectile-recentf)
         (define-key eos-pm-map (kbd "/") 'helm-projectile-find-dir)
         (define-key eos-pm-map (kbd "f") 'helm-projectile-find-file)
         (define-key eos-pm-map (kbd "b") 'helm-projectile-browse-dirty-projects)
         (define-key eos-pm-map (kbd "a")
           'helm-projectile-find-file-in-known-projects)

         ;; dwin
         (define-key eos-pm-map (kbd "w") 'helm-projectile-find-file-dwim)

         ;; helm-swoop
         ;; (define-key eos-pm-map (kbd "S") 'helm-multi-swoop-projectile)

         ;; enable helm-projectile after emacs start
         (add-hook 'after-init-hook 'helm-projectile-on)))

     #+END_SRC

**** Bind

     Set project manager keybinds on eos-pm-map (C-x p).

     #+BEGIN_SRC emacs-lisp

     ;; exit, keyboard quit
     (define-key eos-pm-map (kbd "C-g") 'keyboard-quit)

     ;; set ctl-x-map prefix (C-x p)
     (define-key ctl-x-map (kbd "p") 'eos-pm-map)

     #+END_SRC

*** Navigation
**** Helm-gtags

     #+BEGIN_SRC emacs-lisp

     (when (require 'helm-gtags)
       (progn
         ;; customize
         (customize-set-variable 'helm-gtags-ignore-case t)
         (customize-set-variable 'helm-gtags-auto-update t)
         (customize-set-variable 'helm-gtags-pulse-at-cursor t)
         (customize-set-variable 'helm-gtags-use-input-at-cursor t)
         (customize-set-variable 'helm-gtags-suggested-key-mapping t)

         ;; bind
         (define-key eos-tags-map (kbd "t") 'helm-gtags-dwim)
         (define-key eos-tags-map (kbd "s") 'helm-gtags-select)
         (define-key eos-tags-map (kbd "f") 'helm-gtags-find-tag)
         (define-key eos-tags-map (kbd "+") 'helm-gtags-show-stack)
         (define-key eos-tags-map (kbd "a") 'helm-gtags-parse-file)
         (define-key eos-tags-map (kbd "c") 'helm-gtags-create-tags)
         (define-key eos-tags-map (kbd "u") 'helm-gtags-update-tags)
         (define-key eos-tags-map (kbd "p") 'helm-gtags-find-pattern)
         (define-key eos-tags-map (kbd "r") 'helm-gtags-find-rtag)
         (define-key eos-tags-map (kbd "o") 'helm-gtags-find-tag-other-window)

         ;; enable helm-gtags mode after some programming mode startup
         (add-hook 'porg-mode-hook 'helm-gtags-mode)))

     #+END_SRC

**** Bind

     Set tags (navigation) keybinds on eos-tags-map (C-x t).

     #+BEGIN_SRC emacs-lisp

     ;; exit, keyboard quit
     (define-key eos-tags-map (kbd "C-g") 'keyboard-quit)

     ;; ctl-x-map bind (C-x t)
     (define-key ctl-x-map (kbd "t") 'eos-tags-map)

     #+END_SRC

*** Complete
**** Completition

     #+BEGIN_SRC emacs-lisp

     (add-to-list 'display-buffer-alist
                  '("\\*Completions\\*" display-buffer-below-selected))

     #+END_SRC

