src/init.el

(when (require 'company nil t)
  (progn
    ;; set echo delay
    (customize-set-variable 'company-echo-delay 0.2)

    ;; disable idle delay
    (customize-set-variable 'company-idle-delay nil)

    ;; set tooltip limit
    (customize-set-variable 'company-tooltip-limit 20)

    ;; set prefix length
    (customize-set-variable 'company-minimum-length 2)

    ;; cycle selection
    (customize-set-variable 'company-selection-wrap-around t)

    ;; sort by frequency
    (customize-set-variable 'company-transformers
                            '(company-sort-by-occurrence))

    ;; enable dabbrev downcase (most common)
    (customize-set-variable 'company-dabbrev-downcase t)

    ;; align annotations true
    (customize-set-variable 'company-tooltip-align-annotations nil)

    ;; show candidates number
    ;; to select completions use: M-1, M-2, etc..
    (customize-set-variable 'company-show-numbers t)

    ;; bind
    (define-key eos-complete-map (kbd "M-`") 'company-ispell)
    (define-key eos-complete-map (kbd "2") 'company-dabbrev)
    (define-key eos-complete-map (kbd "3") 'company-dabbrev-code)
    (define-key eos-complete-map (kbd "4") 'company-gtags)
    (define-key eos-complete-map (kbd "5") 'company-files)
    (define-key eos-complete-map (kbd "6") 'company-capf)
    (define-key eos-complete-map (kbd "1") 'company-yasnippet)

    ;; init after emacs initialize
    (add-hook 'after-init-hook 'global-company-mode)))

;; bind
(when (boundp 'company-active-map)
  (progn
    (define-key company-active-map (kbd "C-n") 'company-select-next)
    (define-key company-active-map (kbd "C-p") 'company-select-previous)))

(when (require 'company-statistics nil t)
  (progn

    ;; set company-statistics cache location
    (customize-set-variable
     'company-statistics-file
     (concat user-emacs-directory "cache/company-statistics-cache.el"))

    ;; init after company mode
    (add-hook 'company-mode-hook 'company-statistics-mode)))

(when (require 'yasnippet nil t)
  (progn
    ;; bind
    (define-key eos-complete-map (kbd "q") 'yas-expand)
    (define-key eos-complete-map (kbd "i") 'yas-insert-snippet)
    (define-key eos-complete-map (kbd "v") 'yas-visit-snippet-file)

    ;; initialize after emacs starts
    (add-hook 'after-init-hook 'yas-global-mode)))

(require 'helm-company nil t)

(when (boundp 'helm-company-map)
  (define-key helm-company-map (kbd "SPC") 'helm-keyboard-quit)
  (define-key helm-company-map (kbd "C-j") 'helm-maybe-exit-minibuffer)
  (define-key helm-company-map (kbd "TAB") 'helm-next-line))

;; set company backends
(defun eos/company/set-backends (backends)
  "Set company BACKENDS."
  (make-local-variable 'company-backends)
  (customize-set-variable 'company-backends backends))

;; complete or indent
(defun eos/complete-or-indent ()
  "Complete or indent (TAB)."
  (interactive)
  (if (looking-at "\\_>")
      (progn
        (when (fboundp 'helm-company)
          (helm-company)))
    (indent-according-to-mode)))

;; exit, keyboard quit
(define-key eos-complete-map (kbd "C-g") 'keyboard-quit)

;; set eos-complete-map M-` keybind
(global-set-key (kbd "TAB") 'eos/complete-or-indent)
(global-set-key (kbd "ESC `") 'eos-complete-map)

(require 'gud nil t)

(when (require 'cmake-ide nil t)
  (progn
    ;; setup
    (add-hook 'c-mode-hook 'cmake-ide-setup)
    (add-hook 'c++-mode-hook 'cmake-ide-setup)))

(require 'compile nil t)

;; don't truncate lines
(add-hook 'compilation-mode-hook
          (lambda ()
            (setq truncate-lines nil)))

;; fix compilation buffer colors
(add-hook 'compilation-filter-hook
          (lambda ()
            (when (eq major-mode 'compilation-mode)
              (ansi-color-apply-on-region
               compilation-filter-start (point-max)))))

(add-to-list 'load-path
             (concat user-emacs-directory "elpa/helm-compile"))

(require 'helm-compile nil t)

(when (require 'flycheck nil t)
  (progn
    ;; bind
    (define-key eos-sc-map (kbd "C-g") 'keyboard-quit)
    (define-key eos-sc-map (kbd "m") 'flycheck-mode)
    (define-key eos-sc-map (kbd "M") 'flycheck-manual)
    (define-key eos-sc-map (kbd "o") 'flycheck-list-errors)
    (define-key eos-sc-map (kbd "b") 'flycheck-buffer)

    (define-key eos-sc-map
      (kbd "v") 'flycheck-verify-setup)

    (define-key eos-sc-map
      (kbd "c") 'flycheck-select-checker)

    (define-key eos-sc-map
      (kbd "d") 'flycheck-disable-checker)

    (define-key eos-sc-map
      (kbd "?") 'flycheck-describe-checker)

    ;; init flycheck mode after some programming mode
    ;; is activated (c-mode, elisp-mode, etc).
    (add-hook 'prog-mode-hook 'flycheck-mode)))

(when (require 'helm-flycheck nil t)
  (progn
    ;; binds
    (define-key eos-sc-map (kbd "e") 'helm-flycheck)
    (define-key ctl-x-map (kbd ";") 'helm-flycheck)))

;; auxiliary function
(defun eos/flycheck/set-checker (checker)
  "Set flycheck CHECKER variable."
  (make-local-variable 'flycheck-checker)
  (customize-set-variable 'flycheck-checker checker))

;; bind eos-sc-map prefix to C-x e
(define-key ctl-x-map (kbd "e") 'eos-sc-map)

(when (require 'magit nil t)
  (progn
    ;; bind
    (define-key ctl-x-map (kbd "j") 'magit-status)))

(global-set-key (kbd "C-x <end>")
                (lambda ()
                  (interactive)
                  (eos/run/async-proc "slock")))

(global-set-key (kbd "<print>")
                (lambda ()
                  (interactive)
                  (eos/run/async-proc "scrot")))

;; volume functions (utils)
(defun eos/toggle-audio ()
  "Toggle audio (mute or unmute)."
  (interactive)
  (async-shell-command "amixer -D default set Master mute"))

(defun eos/raise-volume ()
  "Raise the volume (factor +5)."
  (interactive)
  (async-shell-command "amixer -D default set Master 5+ unmute"))

(defun eos/lower-volume ()
  "Lower the volume (factor -5)."
  (interactive)
  (async-shell-command "amixer -D default set Master 5- unmute"))

;; bind
(global-set-key (kbd "<s-f6>") 'eos/toggle-audio)
(global-set-key (kbd "<s-f7>") 'eos/lower-volume)
(global-set-key (kbd "<s-f8>") 'eos/raise-volume)

(add-hook 'org-mode-hook
          (lambda ()
            ;; do not truncate lines
            (setq truncate-lines nil)

            ;; set company backends
            (eos/company/set-backends
             '((company-capf
                company-keywords
                company-yasnippet
                company-ispell
                company-dabbrev
                company-dabbrev-code)
               (company-files)))))
