src/init.org
**** Text

     #+BEGIN_SRC emacs-lisp

     (when (require 'text-mode nil t)
       (progn
         ;; bind
         (define-key text-mode-map (kbd "C-c C-g") 'keyboard-quit)
         (define-key text-mode-map (kbd "TAB") 'eos/complete-or-indent)
         (define-key text-mode-map (kbd "C-c C-k") 'with-editor-cancel)
         (define-key text-mode-map (kbd "C-c C-c") 'with-editor-finish)

         ;; text mode hook
         (add-hook 'text-mode-hook
                   (lambda ()
                     ;; turn on auto fill mode
                     (turn-on-auto-fill)

                     ;; set company backends
                     (eos/company/set-backends
                      '((company-ispell
                         company-keywords
                         company-capf
                         company-dabbrev-code
                         company-dabbrev)
                        (company-files)))))
         ))

     #+END_SRC

**** Markdown

     #+BEGIN_SRC emacs-lisp

     (when (require 'markdown-mode nil t)
       (progn
         ;; customize
         (customize-set-variable 'markdown-command "multimarkdown")))

     ;; bind
     (when (boundp 'markdown-mode-map)
       (progn
         (define-key markdown-mode-map (kbd "TAB") 'eos/complete-or-indent)))

     #+END_SRC

**** DocView
**** Spell-check
*** Analyse
**** Verb
*** Apparence
**** Mesk-term

     Add theme directory to load-path and load the
     default theme (mesk-term).

     #+BEGIN_SRC emacs-lisp

     ;; add eos-theme-dir to theme load path
     (add-to-list 'custom-theme-load-path
                  (concat user-emacs-directory "themes"))

     ;; load theme
     (load-theme 'mesk-term t)

     #+END_SRC

** Development
*** C/C++
**** CC-mode

     #+BEGIN_SRC emacs-lisp

     (require 'cc-mode)

     #+END_SRC

**** Irony

     #+BEGIN_SRC emacs-lisp

     (when (require 'irony nil t)
       (progn
         ;; irony hooks
         (add-hook 'irony-mode-hook 'electric-pair-mode)

         ;; mode hooks (init)
         (add-hook 'c-mode-hook 'irony-mode)
         (add-hook 'c++-mode-hook 'irony-mode)
         (add-hook 'objc-mode-hook 'irony-mode)))

     #+END_SRC

**** Irony-cdb

     #+BEGIN_SRC emacs-lisp

     (when (require 'irony-cdb nil t)
       (progn
         ;; hooks
         (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)))

     #+END_SRC

**** Company-irony

     #+BEGIN_SRC emacs-lisp

     (when (require 'company-irony nil t)
       (progn
         ;; hooks:
         (add-hook 'irony-mode-hook 'company-irony-setup-begin-commands)))

     #+END_SRC

**** Company-c-headers

     #+BEGIN_SRC emacs-lisp

     (require 'company-c-headers nil t)

     #+END_SRC

**** Rtags

     #+BEGIN_SRC emacs-lisp

     (defun eos/cc/load-rtags ()
       "Load rtags manually."
       (eos/load-file (concat user-emacs-directory "rtags/src/rtags.el"))

       ;; load helm-rtags
       (eos/load-file (concat user-emacs-directory "rtags/src/helm-rtags.el"))

       ;; set rtags binary path
       (customize-set-variable
        'rtags-path
        (concat user-emacs-directory "rtags/build/bin/"))

       ;; set helm as the frontend
       (customize-set-variable 'rtags-display-result-backend 'helm)
       (customize-set-variable 'rtags-completing-read-behavior 'helm))

     #+END_SRC

**** Bind

     #+BEGIN_SRC emacs-lisp

     ;; eos rtags prefix map
     (define-key eos-rtags-map (kbd "C-g") 'keyboard-quit)
     (define-key eos-rtags-map (kbd "l") 'rtags-taglist)
     (define-key eos-rtags-map (kbd "I") 'rtags-install)
     (define-key eos-rtags-map (kbd "i") 'rtags-imenu)
     (define-key eos-rtags-map (kbd "t") 'rtags-find-symbol-at-point)
     (define-key eos-rtags-map (kbd "s") 'rtags-find-symbol)
     (define-key eos-rtags-map (kbd "y") 'rtags-symbol-type)
     (define-key eos-rtags-map (kbd "l") 'rtags-symbol-info)
     (define-key eos-rtags-map (kbd "n") 'rtags-rename-symbol)
     (define-key eos-rtags-map (kbd "m") 'rtags-asm-file)
     (define-key eos-rtags-map (kbd "h") 'rtags-find-file-history)
     (define-key eos-rtags-map (kbd "x") 'rtags-fixit)
     (define-key eos-rtags-map (kbd "d") 'rtags-diagnostics)
     (define-key eos-rtags-map (kbd "c") 'rtags-compile-file)
     (define-key eos-rtags-map (kbd "-") 'rtags-compilation-flags)
     (define-key eos-rtags-map (kbd "r") 'rtags-find-references-at-point)
     (define-key eos-rtags-map (kbd "p") 'rtags-find-all-references-at-point)
     (define-key eos-rtags-map (kbd ".")
       'rtags-find-functions-called-by-this-function)

     ;; ser rtags prefix map in c-mode map (C-c r)
     (define-key c-mode-map (kbd "C-c r") 'eos-rtags-map)

     ;; complete or indent
     (define-key c-mode-map (kbd "TAB") 'eos/complete-or-indent)

     #+END_SRC

**** Util

     #+BEGIN_SRC emacs-lisp

     ;; c/c++ garage
     (defun eos/cc/set-company-backends ()
       "Set C/C++ company backends."
       (eos/company/set-backends
        '((company-c-headers)
          (company-irony
           company-yasnippet
           company-capf
           company-keywords
           company-dabbrev
           company-dabbrev-code)
          (company-files))))

     #+END_SRC

**** Add-hook

     This functions will to be called after c/cpp mode starts.

     #+BEGIN_SRC emacs-lisp

     (add-hook 'c-mode-hook
               (lambda ()
                 ;; set cc common company backends
                 (eos/cc/set-company-backends)

                 ;; set dash docset
                 (eos/dash/activate-docset '"C")

                 ;; load rtags
                 (eos/cc/load-rtags)))

     (add-hook 'c++-mode-hook
               (lambda ()
                 ;; set cc common backends (company and flycheck)
                 (eos/cc/set-company-backends)

                 ;; set dash docset
                 (eos/dash/activate-docset '"C++")

                 ;; load rtags
                 (eos/cc/load-rtags)))

     #+END_SRC

*** Lisp
**** Lisp-mode

     #+BEGIN_SRC emacs-lisp

     (require 'lisp-mode nil t)

     (customize-set-variable 'lisp-body-indent 2)

     #+END_SRC

*** Elisp
**** Company-elisp

     #+BEGIN_SRC emacs-lisp

     (require 'company-elisp nil t)

     #+END_SRC

**** Elisp-mode

     #+BEGIN_SRC emacs-lisp

     (require 'elisp-mode nil t)

     ;; bind
     (define-key emacs-lisp-mode-map (kbd "C-c C-f") 'eval-defun)
     (define-key emacs-lisp-mode-map (kbd "C-c C-r") 'eval-region)
     (define-key emacs-lisp-mode-map (kbd "C-c C-c") 'eval-buffer)
     (define-key emacs-lisp-mode-map (kbd "C-c C-e") 'eval-last-sexp)
     (define-key emacs-lisp-mode-map (kbd "TAB") 'eos/complete-or-indent)

     ;; unbind
     (define-key emacs-lisp-mode-map (kbd "DEL") 'nil)
     (define-key emacs-lisp-mode-map (kbd "ESC") 'nil)
     (define-key emacs-lisp-mode-map (kbd "C-x") 'nil)
     (define-key emacs-lisp-mode-map (kbd "C-M-x") 'nil)
     (define-key emacs-lisp-mode-map (kbd "C-M-q") 'nil)

     ;; add-hook
     (add-hook 'emacs-lisp-mode-hook
               (lambda ()
                 ;; set company backends
                 (eos/company/set-backends
                  '((company-elisp
                     company-capf
                     company-yasnippet
                     company-keywords
                     company-dabbrev
                     company-dabbrev-code)
                    (company-files)))
                 ))

     #+END_SRC

*** Sh
**** Sh-script

     #+BEGIN_SRC emacs-lisp

     (require 'sh-script)

     #+END_SRC

**** Company-shell

     #+BEGIN_SRC emacs-lisp

     (require 'company-shell nil t)

     #+END_SRC

**** Add-hook

     #+BEGIN_SRC emacs-lisp

     ;; add backends selection on sh-mode-hook space.
     ;; this function will be called after sh-mode initialize
     (add-hook 'sh-mode-hook
               (lambda ()
                 ;; set company backends
                 (eos/company/set-backends
                  '((company-shell
                     company-shell-env
                     company-yasnippet
                     company-keywords
                     company-capf
                     company-dabbrev-code
                     company-dabbrev)
                    (company-files)))))

     #+END_SRC

*** Fish
**** Fish-mode

     #+BEGIN_SRC emacs-lisp

     (require 'fish-mode nil t)

     #+END_SRC

**** Add-hook

     #+BEGIN_SRC emacs-lisp

     ;; set the proper company backends
     (add-hook 'fish-mode-hook
               (lambda ()
                 (eos/company/set-backends
                  '((company-fish-shell
                     company-shell
                     company-shell-env
                     company-yasnippet
                     company-keywords
                     company-capf
                     company-dabbrev
                     company-dabbrev-code)
                    (company-files)))))

     #+END_SRC

*** Perl
**** Cperl-mode

     #+BEGIN_SRC emacs-lisp

     (require 'cperl-mode nil t)

     #+END_SRC

*** Python

    #+BEGIN_SRC emacs-lisp

    (require 'python nil t)

    #+END_SRC

*** Go
