src/init.org
**** Go-mode

     #+BEGIN_SRC emacs-lisp

     (when (require 'go-mode nil t)
       (progn
         ;; add (*.go . go-mode) to auto-mode-alist
         ;; init go-mode when a file with the extersion .go is opened
         (add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode))))

     #+END_SRC

**** Add-hook

     #+BEGIN_SRC emacs-lisp

     ;; select the proper backends and docset
     (add-hook 'go-mode-hook
               (lambda ()
                 ;; set company backends
                 (eos/company/set-backends
                  '((company-yasnippet
                     company-keywords
                     company-capf
                     company-dabbrev
                     company-dabbrev-code)
                    (company-files)))

                 ;; set dash docsets
                 (eos/dash/activate-docset '"Go")))

     #+END_SRC

*** R

    #+BEGIN_SRC emacs-lisp

    (require 'ess-r-mode nil t)

    #+END_SRC

*** Julia
*** Forms
*** Clojure
*** Vhdl
*** Verilog
*** Mql
*** Cmake
*** Doxygen
**** Highlight-doxygen

     Mode for highlight doxygen sections and its keywords.

     #+BEGIN_SRC emacs-lisp

     (when (require 'highlight-doxygen nil t)
       (progn
         ;; add doxygen
         (add-hook 'prog-mode-hook 'highlight-doxygen-global-mode)))

     #+END_SRC

*** Web
**** Web-mode

    #+BEGIN_SRC emacs-lisp

    (when (require 'web-mode nil t)
      (progn
        (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
        (add-to-list 'auto-mode-alist '("\\.php\\'" . web-mode))
        (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
        (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
        (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
        (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
        (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))))

    (when (boundp 'web-mode-engines-alist)
      (progn
        (add-to-list 'web-mode-engines-alist '(("php" . "\\.phtml\\'")))))

    #+END_SRC

*** PHP
*** HTML

** Unbind
*** Prefix
**** Esc

     #+BEGIN_SRC emacs-lisp

     ;; clean esc map
     (define-key esc-map (kbd "ESC") nil)
     (define-key esc-map (kbd "<f10>") nil)

     #+END_SRC

**** Ctl-x

     #+BEGIN_SRC emacs-lisp

     ;; unbind
     ;; (define-key ctl-x-map (kbd "C-SPC") nil)
     ;; (define-key ctl-x-map (kbd "C-<left>") nil)
     ;; (define-key ctl-x-map (kbd "C-<right>") nil)
     (define-key ctl-x-map (kbd "C-=") nil)
     (define-key ctl-x-map (kbd "C-0") nil)
     (define-key ctl-x-map (kbd "C-z") nil)
     (define-key ctl-x-map (kbd "C-+") nil)
     (define-key ctl-x-map (kbd "C--") nil)
     (define-key ctl-x-map (kbd "C-a") nil)
     (define-key ctl-x-map (kbd "C-l") nil)
     (define-key ctl-x-map (kbd "C-d") nil)
     (define-key ctl-x-map (kbd "C-r") nil)
     (define-key ctl-x-map (kbd "C-n") nil)
     (define-key ctl-x-map (kbd "C-p") nil)
     (define-key ctl-x-map (kbd "C-o") nil)
     (define-key ctl-x-map (kbd "C-h") nil)
     (define-key ctl-x-map (kbd "C-u") nil)
     (define-key ctl-x-map (kbd "C-\@") nil)
     ;;  (define-key ctl-x-map (kbd "ESC") nil)
     (define-key ctl-x-map (kbd "M-:") nil)
     (define-key ctl-x-map (kbd "`") nil)
     (define-key ctl-x-map (kbd ")") nil)
     (define-key ctl-x-map (kbd "(") nil)
     ;; (define-key ctl-x-map (kbd "]") nil)
     ;; (define-key ctl-x-map (kbd "[") nil)
     (define-key ctl-x-map (kbd "<") nil)
     (define-key ctl-x-map (kbd ">") nil)
     (define-key ctl-x-map (kbd "\@") nil)
     (define-key ctl-x-map (kbd "-") nil)
     (define-key ctl-x-map (kbd ";") nil)
     (define-key ctl-x-map (kbd "#") nil)
     (define-key ctl-x-map (kbd "*") nil)
     (define-key ctl-x-map (kbd "'") nil)
     (define-key ctl-x-map (kbd "$") nil)
     (define-key ctl-x-map (kbd "{") nil)
     (define-key ctl-x-map (kbd "}") nil)
     (define-key ctl-x-map (kbd "^") nil)
     (define-key ctl-x-map (kbd "n") nil)
     (define-key ctl-x-map (kbd "f") nil)
     (define-key ctl-x-map (kbd "a") nil)
     (define-key ctl-x-map (kbd "h") nil)
     (define-key ctl-x-map (kbd "v") nil)
     (define-key ctl-x-map (kbd "X") nil)

     #+END_SRC

*** Minor

    Clean minor-mode-map-alist.

    #+BEGIN_SRC emacs-lisp

    ;; clean minor-mode-map-alist
    (setq minor-mode-map-alist nil)

    #+END_SRC

*** Global

    #+BEGIN_SRC emacs-lisp

    ;; unset
    (global-unset-key (kbd "C-z"))
    (global-unset-key (kbd "C-@"))
    (global-unset-key (kbd "C-\\"))
    (global-unset-key (kbd "M-l"))
    (global-unset-key (kbd "M-h"))
    (global-unset-key (kbd "M-\\"))
    (global-unset-key (kbd "M-z"))
    (global-unset-key (kbd "M-SPC"))
    (global-unset-key (kbd "M-$"))
    (global-unset-key (kbd "M-("))
    (global-unset-key (kbd "M-)"))
    (global-unset-key (kbd "M-m"))
    (global-unset-key (kbd "M-r"))
    (global-unset-key (kbd "M-{"))
    (global-unset-key (kbd "M-}"))
    (global-unset-key (kbd "S-SPC"))
    (global-unset-key (kbd "<backtap>"))
    (global-unset-key (kbd "M-="))
    (global-unset-key (kbd "M-@"))
    (global-unset-key (kbd "M-~"))

    ;; (global-unset-key (kbd "M-k"))
    ;; (global-unset-key (kbd "M-t"))
    ;; (global-unset-key (kbd "M-q"))

    (global-unset-key (kbd "C-M-h"))
    (global-unset-key (kbd "C-M-j"))
    (global-unset-key (kbd "C-M-."))
    (global-unset-key (kbd "C-M-l"))
    (global-unset-key (kbd "C-M-/"))
    (global-unset-key (kbd "C-M-;"))
    (global-unset-key (kbd "C-M-@"))
    (global-unset-key (kbd "C-M-\\"))
    (global-unset-key (kbd "C-M-a"))
    (global-unset-key (kbd "C-M-r"))
    (global-unset-key (kbd "C-M-s"))
    (global-unset-key (kbd "C-M-%"))
    (global-unset-key (kbd "C-M-u"))
    (global-unset-key (kbd "C-M-d"))
    (global-unset-key (kbd "C-M-SPC"))
    (global-unset-key (kbd "C-M-S-v"))

    (global-unset-key (kbd "<C-M-end>"))
    (global-unset-key (kbd "<C-M-home>"))
    (global-unset-key (kbd "<C-S-backspace>"))
    (global-unset-key (kbd "<C-backspace>"))
    (global-unset-key (kbd "<C-delete>"))
    (global-unset-key (kbd "<C-down>"))
    (global-unset-key (kbd "<C-next>"))
    (global-unset-key (kbd "<C-end>"))
    (global-unset-key (kbd "<C-f10>"))
    (global-unset-key (kbd "<M-f10>"))

    (global-unset-key (kbd "<bottom-divider>"))
    (global-unset-key (kbd "<bottom-edge>"))
    (global-unset-key (kbd "<bottom-left-corner>"))
    (global-unset-key (kbd "<bottom-right-corner>"))

    (global-unset-key (kbd "<horizontal-scroll-bar>"))
    (global-unset-key (kbd "<vertical-scroll-bar>"))

    (global-unset-key (kbd "<left-edge>"))
    (global-unset-key (kbd "<right-edge>"))

    (global-unset-key (kbd "<undo>"))
    (global-unset-key (kbd "<find>"))
    (global-unset-key (kbd "<help>"))
    (global-unset-key (kbd "<open>"))
    (global-unset-key (kbd "<again>"))
    (global-unset-key (kbd "<menu>"))
    (global-unset-key (kbd "<header-line>"))
    (global-unset-key (kbd "<mode-line>"))

    (global-unset-key (kbd "<XF86Back>"))
    (global-unset-key (kbd "<XF86Forward>"))
    (global-unset-key (kbd "<XF86WakeUp>"))

    (global-unset-key (kbd "<top-edge>"))
    (global-unset-key (kbd "<top-left-corner>"))
    (global-unset-key (kbd "<top-right-corner>"))

    (global-unset-key (kbd "<mouse-1>"))
    (global-unset-key (kbd "<mouse-2>"))
    (global-unset-key (kbd "<mouse-3>"))
    (global-unset-key (kbd "<mouse-4>"))
    (global-unset-key (kbd "<mouse-5>"))
    (global-unset-key (kbd "<mouse-6>"))
    (global-unset-key (kbd "<mouse-7>"))

    (global-unset-key (kbd "<right-divider>"))
    (global-unset-key (kbd "<vertical-line>"))

    (global-unset-key (kbd "<f10>"))
    (global-unset-key (kbd "<f11>"))
    (global-unset-key (kbd "<f16>"))
    (global-unset-key (kbd "<f18>"))
    (global-unset-key (kbd "<f20>"))

    (global-unset-key (kbd "<drag-mouse-1>"))
    (global-unset-key (kbd "<C-mouse-4>"))
    (global-unset-key (kbd "<C-mouse-5>"))
    (global-unset-key (kbd "<C-mouse-6>"))
    (global-unset-key (kbd "<C-mouse-7>"))
    (global-unset-key (kbd "<M-mouse-1>"))
    (global-unset-key (kbd "<M-mouse-2>"))
    (global-unset-key (kbd "<M-mouse-3>"))
    (global-unset-key (kbd "<S-mouse-3>"))
    (global-unset-key (kbd "<S-mouse-4>"))
    (global-unset-key (kbd "<S-mouse-5>"))
    (global-unset-key (kbd "<S-mouse-6>"))
    (global-unset-key (kbd "<S-mouse-7>"))
    (global-unset-key (kbd "<C-down-mouse-1>"))
    (global-unset-key (kbd "<C-down-mouse-2>"))
    (global-unset-key (kbd "<M-down-mouse-1>"))
    (global-unset-key (kbd "<M-drag-mouse-1>"))
    (global-unset-key (kbd "<S-down-mouse-1>"))

    #+END_SRC

** Provide

   #+BEGIN_SRC emacs-lisp

   (provide 'eos)
   ;; eos.el ends here

   #+END_SRC

** EOF

   "See You Space Cowboy.."
   | Cowboy Bebop |
